sterentev/atdf-device-asm-include/inc/ATmegaS64M1.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	CANMSG		= 0xFA		; [MEMORY MAPPED] Message Data Register
.equ	CANSTM		= 0xF8		; [MEMORY MAPPED] Time Stamp Register
.equ	CANIDM1		= 0xF7		; [MEMORY MAPPED] Identifier Mask Register 1
.equ	CANIDM2		= 0xF6		; [MEMORY MAPPED] Identifier Mask Register 2
.equ	CANIDM3		= 0xF5		; [MEMORY MAPPED] Identifier Mask Register 3
.equ	CANIDM4		= 0xF4		; [MEMORY MAPPED] Identifier Mask Register 4
.equ	CANIDT1		= 0xF3		; [MEMORY MAPPED] Identifier Tag Register 1
.equ	CANIDT2		= 0xF2		; [MEMORY MAPPED] Identifier Tag Register 2
.equ	CANIDT3		= 0xF1		; [MEMORY MAPPED] Identifier Tag Register 3
.equ	CANIDT4		= 0xF0		; [MEMORY MAPPED] Identifier Tag Register 4
.equ	CANCDMOB	= 0xEF		; [MEMORY MAPPED] MOb Control and DLC Register
.equ	CANSTMOB	= 0xEE		; [MEMORY MAPPED] MOb Status Register
.equ	CANPAGE		= 0xED		; [MEMORY MAPPED] Page MOb Register
.equ	CANHPMOB	= 0xEC		; [MEMORY MAPPED] Highest Priority MOb Register
.equ	CANREC		= 0xEB		; [MEMORY MAPPED] Receive Error Counter Register
.equ	CANTEC		= 0xEA		; [MEMORY MAPPED] Transmit Error Counter Register
.equ	CANTTC		= 0xE8		; [MEMORY MAPPED] TTC Timer Register
.equ	CANTIM		= 0xE6		; [MEMORY MAPPED] Timer Register
.equ	CANTCON		= 0xE5		; [MEMORY MAPPED] Timer Control Register
.equ	CANBT3		= 0xE4		; [MEMORY MAPPED] CAN Bit Timing Register 3
.equ	CANBT2		= 0xE3		; [MEMORY MAPPED] CAN Bit Timing Register 2
.equ	CANBT1		= 0xE2		; [MEMORY MAPPED] CAN Bit Timing Register 1
.equ	CANSIT1		= 0xE1		; [MEMORY MAPPED] CAN Status Interrupt MOb Register 1 (empty)
.equ	CANSIT2		= 0xE0		; [MEMORY MAPPED] CAN Status Interrupt MOb Register 2
.equ	CANIE1		= 0xDF		; [MEMORY MAPPED] Enable Interrupt MOb Register 1 (empty)
.equ	CANIE2		= 0xDE		; [MEMORY MAPPED] Enable Interrupt MOb Register 2
.equ	CANEN1		= 0xDD		; [MEMORY MAPPED] Enable MOb Register 1(empty)
.equ	CANEN2		= 0xDC		; [MEMORY MAPPED] Enable MOb Register 2
.equ	CANGIE		= 0xDB		; [MEMORY MAPPED] CAN General Interrupt Enable Register
.equ	CANGIT		= 0xDA		; [MEMORY MAPPED] CAN General Interrupt Register Flags
.equ	CANGSTA		= 0xD9		; [MEMORY MAPPED] CAN General Status Register
.equ	CANGCON		= 0xD8		; [MEMORY MAPPED] CAN General Control Register
.equ	LINDAT		= 0xD2		; [MEMORY MAPPED] LIN Data Register
.equ	LINSEL		= 0xD1		; [MEMORY MAPPED] LIN Data Buffer Selection Register
.equ	LINIDR		= 0xD0		; [MEMORY MAPPED] LIN Identifier Register
.equ	LINDLR		= 0xCF		; [MEMORY MAPPED] LIN Data Length Register
.equ	LINBRR		= 0xCD		; [MEMORY MAPPED] LIN Baud Rate Register
.equ	LINBTR		= 0xCC		; [MEMORY MAPPED] LIN Bit Timing Register
.equ	LINERR		= 0xCB		; [MEMORY MAPPED] LIN Error Register
.equ	LINENIR		= 0xCA		; [MEMORY MAPPED] LIN Enable Interrupt Register
.equ	LINSIR		= 0xC9		; [MEMORY MAPPED] LIN Status and Interrupt Register
.equ	LINCR		= 0xC8		; [MEMORY MAPPED] LIN Control Register
.equ	PIFR		= 0xBC		; [MEMORY MAPPED] PSC Interrupt Flag Register
.equ	PIM		= 0xBB		; [MEMORY MAPPED] PSC Interrupt Mask Register
.equ	PMIC2		= 0xBA		; [MEMORY MAPPED] PSC Module 2 Input Control Register
.equ	PMIC1		= 0xB9		; [MEMORY MAPPED] PSC Module 1 Input Control Register
.equ	PMIC0		= 0xB8		; [MEMORY MAPPED] PSC Module 0 Input Control Register
.equ	PCTL		= 0xB7		; [MEMORY MAPPED] PSC Control Register
.equ	POC		= 0xB6		; [MEMORY MAPPED] PSC Output Configuration
.equ	PCNF		= 0xB5		; [MEMORY MAPPED] PSC Configuration Register
.equ	PSYNC		= 0xB4		; [MEMORY MAPPED] PSC Synchro Configuration
.equ	POCR_RB		= 0xB2		; [MEMORY MAPPED] PSC Output Compare RB Register 
.equ	POCR2SB		= 0xB0		; [MEMORY MAPPED] PSC Module 2 Output Compare SB Register 
.equ	POCR2RA		= 0xAE		; [MEMORY MAPPED] PSC Module 2 Output Compare RA Register 
.equ	POCR2SA		= 0xAC		; [MEMORY MAPPED] PSC Module 2 Output Compare SA Register 
.equ	POCR1SB		= 0xAA		; [MEMORY MAPPED] PSC Module 1 Output Compare SB Register 
.equ	POCR1RA		= 0xA8		; [MEMORY MAPPED] PSC Module 1 Output Compare RA Register 
.equ	POCR1SA		= 0xA6		; [MEMORY MAPPED] PSC Output Compare SA Register 
.equ	POCR0SB		= 0xA4		; [MEMORY MAPPED] PSC Output Compare SB Register 
.equ	POCR0RA		= 0xA2		; [MEMORY MAPPED] PSC Module 0 Output Compare RA Register 
.equ	POCR0SA		= 0xA0		; [MEMORY MAPPED] PSC Module 0 Output Compare SA Register 
.equ	AC3CON		= 0x97		; [MEMORY MAPPED] Analog Comparator 3 Control Register
.equ	AC2CON		= 0x96		; [MEMORY MAPPED] Analog Comparator 2 Control Register
.equ	AC1CON		= 0x95		; [MEMORY MAPPED] Analog Comparator 1 Control Register
.equ	AC0CON		= 0x94		; [MEMORY MAPPED] Analog Comparator 0 Control Register
.equ	DAC		= 0x91		; [MEMORY MAPPED] DAC Data Register
.equ	DACON		= 0x90		; [MEMORY MAPPED] DAC Control Register
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register B
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register A
.equ	ICR1		= 0x86		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer/Counter1  Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	ADMUX		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register
.equ	ADC		= 0x78		; [MEMORY MAPPED] ADC Data Register  Bytes
.equ	AMP2CSR		= 0x77		; [MEMORY MAPPED] Amplifier 2 Control and Status Register
.equ	AMP1CSR		= 0x76		; [MEMORY MAPPED] Amplifier 1 Control and Status Register
.equ	AMP0CSR		= 0x75		; [MEMORY MAPPED] Amplifier 0 Control and Status Register
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	PCMSK3		= 0x6D		; [MEMORY MAPPED] Pin Change Mask Register 3
.equ	PCMSK2		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 2
.equ	PCMSK1		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6A		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	OSCCAL		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PRR		= 0x64		; [MEMORY MAPPED] Power Reduction Register
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] 
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	ACSR		= 0x30		; Analog Comparator Status Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	PLLCSR		= 0x29		; PLL Control And Status Register
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register B
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register A
.equ	TCNT0		= 0x26		; Timer/Counter0
.equ	TCCR0B		= 0x25		; Timer/Counter Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter  Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	GPIOR2		= 0x1A		; General Purpose IO Register 2
.equ	GPIOR1		= 0x19		; General Purpose IO Register 1
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag register
.equ	PORTE		= 0x0E		; Port E Data Register
.equ	DDRE		= 0x0D		; Port E Data Direction Register
.equ	PINE		= 0x0C		; Port E Input Pins
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins
.equ	PORTC		= 0x08		; Port C Data Register
.equ	DDRC		= 0x07		; Port C Data Direction Register
.equ	PINC		= 0x06		; Port C Input Pins
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins


; ====	CAN MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register CANGCON bits		------------------------
.equ	ABRQ		= 7		; 0x80 - Abort Request
.equ	OVRQ		= 6		; 0x40 - Overload Frame Request
.equ	TTC		= 5		; 0x20 - Time Trigger Communication
.equ	SYNTTC		= 4		; 0x10 - Synchronization of TTC
.equ	LISTEN		= 3		; 0x08 - Listening Mode
.equ	TEST		= 2		; 0x04 - Test Mode
.equ	ENASTB		= 1		; 0x02 - Enable / Standby
.equ	SWRES		= 0		; 0x01 - Software Reset Request

