sterentev/atdf-device-asm-include/inc/ATmegaS64M1.inc
; ----------	Register PMIC2 bits		------------------------
.equ	POVEN2		= 7		; 0x80 - PSC Module 2 Overlap Enable
.equ	PISEL2		= 6		; 0x40 - PSC Module 2 Input Select
.equ	PELEV2		= 5		; 0x20 - PSC Module 2 Input Level Selector
.equ	PFLTE2		= 4		; 0x10 - PSC Module 2 Input Filter Enable
.equ	PAOC2		= 3		; 0x08 - PSC Module 2 Asynchronous Output Control
.equ	PRFM2_MASK	= 0x07		;      - PSC Module 2 Input Mode bits (3 bits)
.equ	PRFM20		= 0		;          PRFM2 BIT0 position

; ----------	Register PMIC1 bits		------------------------
.equ	POVEN1		= 7		; 0x80 - PSC Module 1 Overlap Enable
.equ	PISEL1		= 6		; 0x40 - PSC Module 1 Input Select
.equ	PELEV1		= 5		; 0x20 - PSC Module 1 Input Level Selector
.equ	PFLTE1		= 4		; 0x10 - PSC Module 1 Input Filter Enable
.equ	PAOC1		= 3		; 0x08 - PSC Module 1 Asynchronous Output Control
.equ	PRFM1_MASK	= 0x07		;      - PSC Module 1 Input Mode bits (3 bits)
.equ	PRFM10		= 0		;          PRFM1 BIT0 position

; ----------	Register PMIC0 bits		------------------------
.equ	POVEN0		= 7		; 0x80 - PSC Module 0 Overlap Enable
.equ	PISEL0		= 6		; 0x40 - PSC Module 0 Input Select
.equ	PELEV0		= 5		; 0x20 - PSC Module 0 Input Level Selector
.equ	PFLTE0		= 4		; 0x10 - PSC Module 0 Input Filter Enable
.equ	PAOC0		= 3		; 0x08 - PSC Module 0 Asynchronous Output Control
.equ	PRFM0_MASK	= 0x07		;      - PSC Module 0 Input Mode bits (3 bits)
.equ	PRFM00		= 0		;          PRFM0 BIT0 position

; ----------	Register PCTL bits		------------------------
.equ	PPRE_MASK	= 0xC0		;      - PSC Prescaler Select bits (2 bits)
.equ	PPRE0		= 6		;          PPRE BIT0 position
.equ	PCLKSEL		= 5		; 0x20 - PSC Input Clock Select
.equ	PCCYC		= 1		; 0x02 - PSC Complete Cycle
.equ	PRUN		= 0		; 0x01 - PSC Run

; ----------	Register POC bits		------------------------
.equ	POEN2B		= 5		; 0x20 - PSC Output 2B Enable
.equ	POEN2A		= 4		; 0x10 - PSC Output 2A Enable
.equ	POEN1B		= 3		; 0x08 - PSC Output 1B Enable
.equ	POEN1A		= 2		; 0x04 - PSC Output 1A Enable
.equ	POEN0B		= 1		; 0x02 - PSC Output 0B Enable
.equ	POEN0A		= 0		; 0x01 - PSC Output 0A Enable

; ----------	Register PCNF bits		------------------------
.equ	PULOCK		= 5		; 0x20 - PSC Update Lock
.equ	PMODE		= 4		; 0x10 - PSC Mode
.equ	POPB		= 3		; 0x08 - PSC Output B Polarity
.equ	POPA		= 2		; 0x04 - PSC Output A Polarity

; ----------	Register PSYNC bits		------------------------
.equ	PSYNC2_MASK	= 0x30		;      - Selection of Synchronization Out for ADC (2 bits)
.equ	PSYNC20		= 4		;          PSYNC2 BIT0 position
.equ	PSYNC1_MASK	= 0x0C		;      - Selection of Synchronization Out for ADC (2 bits)
.equ	PSYNC10		= 2		;          PSYNC1 BIT0 position
.equ	PSYNC0_MASK	= 0x03		;      - Selection of Synchronization Out for ADC (2 bits)
.equ	PSYNC00		= 0		;          PSYNC0 BIT0 position




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 31
.equ	INT_VECTORS_SIZE	= 0x3E
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;	1	ANACOMP0	; Analog Comparator 0
;	2	ANACOMP1	; Analog Comparator 1
;	3	ANACOMP2	; Analog Comparator 2
;	4	ANACOMP3	; Analog Comparator 3
;	5	PSC_FAULT	; PSC Fault
;	6	PSC_EC		; PSC End of Cycle
;	7	INT0		; External Interrupt Request 0
;	8	INT1		; External Interrupt Request 1
;	9	INT2		; External Interrupt Request 2
;	10	INT3		; External Interrupt Request 3
;	11	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	12	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	13	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	14	TIMER1_OVF	; Timer1/Counter1 Overflow
;	15	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	16	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	17	TIMER0_OVF	; Timer/Counter0 Overflow
;	18	CAN_INT		; CAN MOB, Burst, General Errors
;	19	CAN_TOVF	; CAN Timer Overflow
;	20	LIN_TC		; LIN Transfer Complete
;	21	LIN_ERR		; LIN Error
;	22	PCINT0		; Pin Change Interrupt Request 0
;	23	PCINT1		; Pin Change Interrupt Request 1
;	24	PCINT2		; Pin Change Interrupt Request 2
;	25	PCINT3		; Pin Change Interrupt Request 3
;	26	SPI_STC		; SPI Serial Transfer Complete
;	27	ADC		; ADC Conversion Complete
;	28	WDT		; Watchdog Time-Out Interrupt
;	29	EE_READY	; EEPROM Ready
;	30	SPM_READY	; Store Program Memory Read



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmegaS64M1.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	BODLEVEL	= 0x07	; Brown-out detection disabled
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  & ~(0 <<PSCRB) \
;#				  & ~(0 <<PSCRVA) \
;#				  & ~(0 <<PSCRVB) \
;#				  &  (~BODLEVEL_MASK | BODLEVEL)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=2048 words Boot address=$7800
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<RSTDISBL) \
;#				  & ~(0 <<DWEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x22	; Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "EXTENDED	", FUSES_EXTENDED
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset
;#		reti			; ANACOMP0	 - Analog Comparator 0
;#		reti			; ANACOMP1	 - Analog Comparator 1
;#		reti			; ANACOMP2	 - Analog Comparator 2
;#		reti			; ANACOMP3	 - Analog Comparator 3
;#		reti			; PSC_FAULT	 - PSC Fault
;#		reti			; PSC_EC	 - PSC End of Cycle
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer1/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; CAN_INT	 - CAN MOB, Burst, General Errors
;#		reti			; CAN_TOVF	 - CAN Timer Overflow
;#		reti			; LIN_TC	 - LIN Transfer Complete
;#		reti			; LIN_ERR	 - LIN Error
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; PCINT3	 - Pin Change Interrupt Request 3
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		reti			; WDT		 - Watchdog Time-Out Interrupt
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; SPM_READY	 - Store Program Memory Read
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGAS64M1_INC_ */

; ************************ END OF FILE *********************************

